In [52]:
import pandas as pd

In [54]:
titanic_df = pd.read_csv("Titanic_data.csv")

In [55]:
titanic_df.shape

(891, 12)

In [56]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [74]:
titanic_df.Survived

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

# Exploration
Data Extraction and Exploration

 Data Cleaning

In [71]:
titanic_df = pd.read_csv("Titanic_Data.csv")

## Basic Inforation

In [58]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

# Specific Information

In [72]:
titanic_df[["Age", "Fare"]].mean()

Age     29.699118
Fare    32.204208
dtype: float64

In [73]:
titanic_df[["Age", "Fare"]].median()

Age     28.0000
Fare    14.4542
dtype: float64

In [61]:
titanic_df[["Age", "Fare"]].describe()

              Age        Fare
count  714.000000  891.000000
mean    29.699118   32.204208
std     14.526497   49.693429
min      0.420000    0.000000
25%     20.125000    7.910400
50%     28.000000   14.454200
75%     38.000000   31.000000
max     80.000000  512.329200

In [62]:
titanic_df.value_counts("Survived")

Survived
0    549
1    342
Name: count, dtype: int64

In [66]:
titanic_df.value_counts(["Sex", "Survived"], normalize = True)

Sex     Survived
male    0           0.525253
female  1           0.261504
male    1           0.122334
female  0           0.090909
Name: proportion, dtype: float64

In [67]:
titanic_df[(titanic_df.Embarked=="S") & (titanic_df.Sex=="male")]["Survived"].mean()

np.float64(0.1746031746031746)

In [68]:
titanic_df.value_counts(["Embarked"]=="S") & (titanic_df["Sex"]=="male")]["Survived"].mean() * 100

np.float64(17.46031746031746)

In [69]:
titanic_df[titanic_df["Embarked"]=="S"].value_counts(["Sex", "Survived"], normalize=True).loc["male", 1]

np.float64(0.11956521739130435)

In [70]:
titanic_df[
    (titanic_df.Embarked == "S") & (titanic_df["Sex"] == "male")
].value_counts('Survived')

Survived
0    364
1     77
Name: count, dtype: int64

In [76]:
pd.crosstab(
    titanic_df.Sex,
    titanic_df.Survived,
    margins = True
)

Survived    0    1  All
Sex
female     81  233  314
male      468  109  577
All       549  342  891

In [77]:
pd.crosstab(
    titanic_df.Sex,
    titanic_df.Survived,
    margins = False
)

Survived    0    1
Sex
female     81  233
male      468  109

In [79]:
pd.crosstab(
    titanic_df.Sex,
    titanic_df.Survived,
    margins = True,
    colnames = ["Alive"]
)

Alive     0    1  All
Sex
female   81  233  314
male    468  109  577
All     549  342  891

In [81]:
import numpy as np

pd.crosstab(
    titanic_df.Sex,
    titanic_df.Survived,
    margins = True,
    values = titanic_df.Fare,
    aggfunc = "mean"
)

Survived          0          1        All
Sex
female    23.024385  51.938573  44.479818
male      21.960993  40.821484  25.523893
All       22.117887  48.395408  32.204208

In [82]:
pd.crosstab(
    titanic_df.Sex,
    titanic_df.Survived,
    margins = True,
    margins_name= "Total"
)

Survived    0    1  Total
Sex
female     81  233    314
male      468  109    577
Total     549  342    891

In [83]:
pd.crosstab(
    [titanic_df.Embarked, titanic_df.Pclass],
    [titanic_df.Sex, titanic_df.Survived],
    margins = True
)

Sex             female      male       All
Survived             0    1    0    1
Embarked Pclass
C        1           1   42   25   17   85
         2           0    7    8    2   17
         3           8   15   33   10   66
Q        1           0    1    1    0    2
         2           0    2    1    0    3
         3           9   24   36    3   72
S        1           2   46   51   28  127
         2           6   61   82   15  164
         3          55   33  231   34  353
All                 81  231  468  109  889

In [84]:
pd.crosstab(
    [titanic_df.Embarked, titanic_df.Pclass],
    [titanic_df.Sex, titanic_df.Survived],
    margins = True
).T

Embarked          C          Q           S            All
Pclass            1   2   3  1  2   3    1    2    3
Sex    Survived
female 0          1   0   8  0  0   9    2    6   55   81
       1         42   7  15  1  2  24   46   61   33  231
male   0         25   8  33  1  1  36   51   82  231  468
       1         17   2  10  0  0   3   28   15   34  109
All              85  17  66  2  3  72  127  164  353  889